_org/books/The Miracle Morning.org
#+BEGIN_HTML
---
layout: notes
---
#+END_HTML
#+TOC: headlines 4

The Miracle Morning: /The Not-So-Obvious Secret Guaranteed to
Transform Your Life (Before 8AM)/ -— /Hal Elrod/

It begins with accepting total responsibility for every aspect of your
life and *refusing to blame anyone else*.

I mark up all of my books so I can revisit them anytime and *quickly
recapture* all of the *key benefits*, *without* having to read *the*
entire *book* again.

The biggest adventure you can ever take is to live the life of your dreams.

*You must dedicate time each day to becoming the person you need to be.*

How you wake up each day and your morning routine dramatically affects
your levels of success in every single area of your life. By simply
changing the way you wake up in the morning, you can transform any
area of your life, faster than you ever thought possible.

#+BEGIN_QUOTE
Your level of success, will rarely exceed your level of personal
development, because success is something you attract by the person
you become.
#+END_QUOTE

Our level of success is always going to parallel our level of personal
development.

I had to commit to making personal development a priority in my daily life.

Every day we face the same universal challenge: to *overcome
mediocrity and live to our full potential*.

1. Acknowledge the 95% Reality Check
2. Identify the Causes of Mediocrity
3. Draw Your Line In the Sand

My past does not equal my future. Talk to yourself in a way that
inspires confidence that not only is anything possible, but that you
are capable and committed to making it so.

Schedule some time to think about and articulate your life
purpose. Write it down where you’ll see it every day.

Every single thought, choice, and action is determining who we are
becoming, which will ultimately determine the quality of our lives.

Always remember that who you’re becoming is far more important than
what you’re doing, and yet it is *what you’re doing that is
determining who you’re becoming.*

Research has shown that we virtually become like the average of the
five people we spend the most time with. Spend time
with positive, successful achievers and inevitably their attitudes and
successful habits will reflect on you. You’ll become more and more
like them.

Our levels of success will rarely exceed our level of personal
development, because *success is something we attract by who we become.*

Your entire life changes the day that you decide you will no longer
accept mediocrity for yourself.

When you delay waking up until you have to—meaning you wait until the
last possible moment to get out of bed and start your day—consider
that what you’re actually doing is resisting your life.

On the other hand, when you wake up each day with passion and purpose,
you join the small percentage of high achievers who are living their
dreams.

1. Set Your Intentions Before Bed
2. Move Your Alarm Clock Across The Room
3. Brush Your Teeth
4. Drink a Full Glass of Water
5. Get Dressed or Jump In the Shower

#+BEGIN_QUOTE
Start every morning off with a personal success ritual. That is the
most important key to success.
#+END_QUOTE

*The fastest way to achieve everything you want is to model successful
people who have already achieved it.*

Accelerated Growth – Then, I began to tap into the highest point of
value I would gain from reviewing my journals. I pulled out a sheet of
blank paper, drew a line down the middle, and wrote two headings at
the top: Lessons Learned and New Commitments.

Gain Clarity – The process of writing something down forces us to
think through it enough to understand it. Journaling will give you
more clarity, allow you to brainstorm, and help you work through
problems.

Capture Ideas – Journaling helps you not only expand your ideas, but
also prevents you from losing the important ideas that you may want to
act on in the future. Review Lessons – It enables you to review all of
the lessons you’ve learned.

Acknowledge Your Progress – It’s wonderful to go back and re-read
your journal entries from a year ago and see how much progress you’ve
made. It’s one of the most empowering, confidence-inspiring and
enjoyable experiences. It can’t really be duplicated any other way.

You don’t actually have to do The Miracle Morning in the morning.

Overcoming Procrastination: *Do the Worst, First*.

It’s important to mix things up and keep variety in your Miracle
Morning.

The problem for most people is that they don’t realize that this
seemingly unbearable first 10 days is only “temporary.” Instead, they
think it’s the way the new habit feels, and will always feel, telling
themselves: If the new habit is this painful, forget it—it’s not worth
it.
