books/The Miracle Morning.html
---
layout: notes
---
<p>
The Miracle Morning: <i>The Not-So-Obvious Secret Guaranteed to
Transform Your Life (Before 8AM)</i> -— <i>Hal Elrod</i>
</p>

<p>
It begins with accepting total responsibility for every aspect of your
life and <b>refusing to blame anyone else</b>.
</p>

<p>
I mark up all of my books so I can revisit them anytime and <b>quickly
recapture</b> all of the <b>key benefits</b>, <b>without</b> having to read <b>the</b>
entire <b>book</b> again.
</p>

<p>
The biggest adventure you can ever take is to live the life of your dreams.
</p>

<p>
<b>You must dedicate time each day to becoming the person you need to be.</b>
</p>

<p>
How you wake up each day and your morning routine dramatically affects
your levels of success in every single area of your life. By simply
changing the way you wake up in the morning, you can transform any
area of your life, faster than you ever thought possible.
</p>

<blockquote>
<p>
Your level of success, will rarely exceed your level of personal
development, because success is something you attract by the person
you become.
</p>
</blockquote>

<p>
Our level of success is always going to parallel our level of personal
development.
</p>

<p>
I had to commit to making personal development a priority in my daily life.
</p>

<p>
Every day we face the same universal challenge: to <b>overcome
mediocrity and live to our full potential</b>.
</p>

<ol class="org-ol">
<li>Acknowledge the 95% Reality Check
</li>
<li>Identify the Causes of Mediocrity
</li>
<li>Draw Your Line In the Sand
</li>
</ol>

<p>
My past does not equal my future. Talk to yourself in a way that
inspires confidence that not only is anything possible, but that you
are capable and committed to making it so.
</p>

<p>
Schedule some time to think about and articulate your life
purpose. Write it down where you’ll see it every day.
</p>

<p>
Every single thought, choice, and action is determining who we are
becoming, which will ultimately determine the quality of our lives.
</p>

<p>
Always remember that who you’re becoming is far more important than
what you’re doing, and yet it is <b>what you’re doing that is
determining who you’re becoming.</b>
</p>

<p>
Research has shown that we virtually become like the average of the
five people we spend the most time with. Spend time
with positive, successful achievers and inevitably their attitudes and
successful habits will reflect on you. You’ll become more and more
like them.
</p>

<p>
Our levels of success will rarely exceed our level of personal
development, because <b>success is something we attract by who we become.</b>
</p>

<p>
Your entire life changes the day that you decide you will no longer
accept mediocrity for yourself.
</p>

<p>
When you delay waking up until you have to—meaning you wait until the
last possible moment to get out of bed and start your day—consider
that what you’re actually doing is resisting your life.
</p>

<p>
On the other hand, when you wake up each day with passion and purpose,
you join the small percentage of high achievers who are living their
dreams.
</p>

<ol class="org-ol">
<li>Set Your Intentions Before Bed
</li>
<li>Move Your Alarm Clock Across The Room
</li>
<li>Brush Your Teeth
</li>
<li>Drink a Full Glass of Water
</li>
<li>Get Dressed or Jump In the Shower
</li>
</ol>

<blockquote>
<p>
Start every morning off with a personal success ritual. That is the
most important key to success.
</p>
</blockquote>

<p>
<b>The fastest way to achieve everything you want is to model successful
people who have already achieved it.</b>
</p>

<p>
Accelerated Growth – Then, I began to tap into the highest point of
value I would gain from reviewing my journals. I pulled out a sheet of
blank paper, drew a line down the middle, and wrote two headings at
the top: Lessons Learned and New Commitments.
</p>

<p>
Gain Clarity – The process of writing something down forces us to
think through it enough to understand it. Journaling will give you
more clarity, allow you to brainstorm, and help you work through
problems.
</p>

<p>
Capture Ideas – Journaling helps you not only expand your ideas, but
also prevents you from losing the important ideas that you may want to
act on in the future. Review Lessons – It enables you to review all of
the lessons you’ve learned.
</p>

<p>
Acknowledge Your Progress – It’s wonderful to go back and re-read
your journal entries from a year ago and see how much progress you’ve
made. It’s one of the most empowering, confidence-inspiring and
enjoyable experiences. It can’t really be duplicated any other way.
</p>

<p>
You don’t actually have to do The Miracle Morning in the morning.
</p>

<p>
Overcoming Procrastination: <b>Do the Worst, First</b>.
</p>

<p>
It’s important to mix things up and keep variety in your Miracle
Morning.
</p>

<p>
The problem for most people is that they don’t realize that this
seemingly unbearable first 10 days is only “temporary.” Instead, they
think it’s the way the new habit feels, and will always feel, telling
themselves: If the new habit is this painful, forget it—it’s not worth
it.
</p>
